; domain
(define (domain minerob)
  (:requirements :strips :typing :negative-preconditions :equality :adl)

  (:types area minecar)

  (:predicates
    (robot-at ?a - area)                    ;; robot is located at area ?a
    (minecar-at ?m - minecar ?a - area)     ;; minecar ?m is at area ?a
    (minerals ?a - area)                    ;; area ?a contains minerals
    (depleted ?a - area)                    ;; area ?a has been depleted (no minerals)
    (empty ?a - area)                       ;; there is no minecar in area ?a
    (adjacent ?a1 - area ?a2 - area)        ;; adjacency (horizontal/vertical)
  )

  ;; MOVE: robot walks from one area to an adjacent area.
  ;; Precondition: destination must be empty of minecars.
  (:action move
    :parameters (?from - area ?to - area)
    :precondition (and
      (robot-at ?from)
      (adjacent ?from ?to)
      ;(empty ?to)                            ;; cannot step into a minecar
    )
    :effect (and
      (not (robot-at ?from))
      (robot-at ?to)
    )
  )

  ;; COLLECT: robot drills and collects minerals in current area.
  (:action collect
    :parameters (?a - area)
    :precondition (and
      (robot-at ?a)
      (minerals ?a)
      (empty ?a)                               ;; not minecart into to collect
    )
    :effect (and
      (not (minerals ?a))
      (depleted ?a)
    )
  )

  ;; PUSH: robot pushes a minecar forward.
  ;; Semantics chosen: robot stands *behind* the minecar, pushes the minecar from its current cell into the next cell.
  ;; Precond: robot adjacent to minecar source cell, the target cell (where the minecar will go) is adjacent to the minecar cell and is empty.
  ;; Effects: robot moves into the minecar's old cell, minecar moves into the target cell;
  ;;          minecar's old cell becomes empty, the target cell becomes non-empty.
  (:action push
    :parameters (?m - minecar ?mcpos - area ?target - area)
    :precondition (and
      (robot-at ?mcpos)
      (minecar-at ?m ?mcpos)
      (adjacent ?mcpos ?target)              ;; target is adjacent to minecar cell
      (empty ?target)                         ;; target must be free of minecars
    )
    :effect (and
      ;; robot moves into minecar's old position
      ;(not (robot-at ?rpos))
      ;(robot-at ?mcpos)

      ;; minecar moves from mcpos to target
      (not (minecar-at ?m ?mcpos))
      (minecar-at ?m ?target)

      ;; empty predicate bookkeeping
      (empty ?mcpos)                          ;; old minecar cell becomes empty
      (not (empty ?target))                   ;; new minecar cell becomes non-empty
    )
  )
)

; problem
(define (problem minerob-first-example-3x3)
  (:domain minerob)

  (:objects
    a1 a2 a3 a4 a5 a6 a7 a8 a9 - area
    carA carB carC - minecar
  )

  ;; initial state
  (:init
    ;; adjacency (grid 3x3)
    ;; row 1
    (adjacent a1 a2) (adjacent a2 a1)
    (adjacent a2 a3) (adjacent a3 a2)
    (adjacent a4 a5) (adjacent a5 a4)
    (adjacent a5 a6) (adjacent a6 a5)
    (adjacent a7 a8) (adjacent a8 a7)
    (adjacent a8 a9) (adjacent a9 a8)

    (adjacent a1 a4) (adjacent a4 a1)
    (adjacent a2 a5) (adjacent a5 a2)
    (adjacent a3 a6) (adjacent a6 a3)
    (adjacent a4 a7) (adjacent a7 a4)
    (adjacent a5 a8) (adjacent a8 a5)
    (adjacent a6 a9) (adjacent a9 a6)

    ;; robot start
    (robot-at a7)

    ;; minecars initial positions
    (minecar-at carA a1)
    (minecar-at carB a6)
    (minecar-at carC a9)

    ;; empty bookkeeping: any cell with no minecar must be declared empty
    (empty a2) (empty a3) (empty a4) (empty a5) (empty a7) (empty a8)

    ;; minerals (some cells have minerals)
    (minerals a2)
    (minerals a3)
    (minerals a4)

    ;; others are depleted/without minerals (you may add depleted facts if needed)
    (depleted a1)
    (depleted a5)
    (depleted a6)
    (depleted a7)
    (depleted a8)
    (depleted a9)
    
  )

  ;; goal: all minerals collected (depleted) and specific final minecar positions
  (:goal (and
    (depleted a2)
    (depleted a3)
    (depleted a4)

    ;; final positions for minecars (example)
    (minecar-at carA a2)
    (minecar-at carB a3)
    (minecar-at carC a7)

    ;; final position for robot
    (robot-at a4)
  ))
)

; plan
1. (move a7 a8)
   deleted: (robot-at a7)
   added: (robot-at a8)
   goals met: 0 of 7
2. (move a8 a9)
   deleted: (robot-at a8)
   added: (robot-at a9)
   goals met: 0 of 7
3. (push carc a9 a8)
   deleted: (minecar-at carc a9) (empty a8)
   added: (minecar-at carc a8) (empty a9)
   goals met: 0 of 7
4. (move a9 a8)
   deleted: (robot-at a9)
   added: (robot-at a8)
   goals met: 0 of 7
5. (push carc a8 a7)
   deleted: (minecar-at carc a8) (empty a7)
   added: (minecar-at carc a7) (empty a8)
   goals met: 1 of 7
6. (move a8 a9)
   deleted: (robot-at a8)
   added: (robot-at a9)
   goals met: 1 of 7
7. (move a9 a6)
   deleted: (robot-at a9)
   added: (robot-at a6)
   goals met: 1 of 7
8. (move a6 a3)
   deleted: (robot-at a6)
   added: (robot-at a3)
   goals met: 1 of 7
9. (collect a3)
   deleted: (minerals a3)
   added: (depleted a3)
   goals met: 2 of 7
10. (move a3 a6)
   deleted: (robot-at a3)
   added: (robot-at a6)
   goals met: 2 of 7
11. (push carb a6 a3)
   deleted: (minecar-at carb a6) (empty a3)
   added: (minecar-at carb a3) (empty a6)
   goals met: 3 of 7
12. (move a6 a3)
   deleted: (robot-at a6)
   added: (robot-at a3)
   goals met: 3 of 7
13. (move a3 a2)
   deleted: (robot-at a3)
   added: (robot-at a2)
   goals met: 3 of 7
14. (collect a2)
   deleted: (minerals a2)
   added: (depleted a2)
   goals met: 4 of 7
15. (move a2 a1)
   deleted: (robot-at a2)
   added: (robot-at a1)
   goals met: 4 of 7
16. (push cara a1 a2)
   deleted: (minecar-at cara a1) (empty a2)
   added: (minecar-at cara a2) (empty a1)
   goals met: 5 of 7
17. (move a1 a4)
   deleted: (robot-at a1)
   added: (robot-at a4)
   goals met: 6 of 7
18. (collect a4)
   deleted: (minerals a4)
   added: (depleted a4)
   goals met: 7 of 7
